<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"8e266d5aaa681c02348a48ec00dfcda4f70c5e70df2afe59d271defe992f7cf9","plan_job_ref":"Job Run Terraform plan in staging #57 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/11055189820","plan_out_hash":"c09655e3cd63571e6f1b7a1ff20fc74a6a3e79005e0c627479553c63d6f19600","plan_hash":"8a7c9611b207b2fb4a87db1d9fc781eea0f31fd9abe7ffa9da0a48fbe96a5b44","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/staging__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.egress_space.cloudfoundry_space.space will be created
+   resource "cloudfoundry_space" "space" {
+       allow_ssh                = (known after apply)
+       auditors                 = (known after apply)
+       delete_recursive_allowed = true
+       developers               = (known after apply)
+       id                       = (known after apply)
+       managers                 = (known after apply)
+       name                     = "rahearn-egress"
+       org                      = "f0a46189-6f64-43fb-99c3-0719cf9ee255"
    }

  # module.egress_space.cloudfoundry_space_users.space_permissions will be created
+   resource "cloudfoundry_space_users" "space_permissions" {
+       auditors   = (known after apply)
+       developers = [
+           "9ffca92e-54bd-412f-913f-8f6271a1d0ac",
        ]
+       force      = false
+       id         = (known after apply)
+       managers   = [
+           "6ca5b315-3eec-4e1f-a2a7-d22c3fe3508b",
+           "9ffca92e-54bd-412f-913f-8f6271a1d0ac",
        ]
+       space      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #57](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/11055189820)